/*
有N堆纸牌，编号分别为1,2,…,N。每堆上有若干张，但纸牌总数必为N的倍数。可以在任一堆上取若干张纸牌，然后移动.
移牌规则为：在编号为1堆上取的纸牌，只能移到编号为2的堆上；在编号为N的堆上取的纸牌，只能移到编号为N−1的堆上；其他堆上取的纸牌，可以移到相邻左边或右边的堆上。
现在要求找出一种移动方法，用最少的移动次数使每堆上纸牌数都一样多。
*/
#include <cstdio>
int a[10005];
int main(int argc, char const *argv[])
{
    int n,sum = 0, aver,ans = 0;
    scanf("%d", &n);
    for(int i = 0; i < n; i++){
        scanf("%d", &a[i]);
        sum+=a[i];
    }
    // 确定最终结果状态
    aver = sum/n;	
    // 考虑每一堆纸牌向下一堆纸牌获取纸牌，直到满足最终结果状态。 在计算过程中可能出现负数，与减法运算的借位类似，不影响最终结果			
    for(int i = 0; i < n-1; i++){
        if(a[i]!=aver){
            a[i+1] += a[i]-aver;
            ans++;
        }
    }
    printf("%d", ans);
    return 0;
}
 